app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists"
---
  def new
    if params[:artist_id] && Artist.exists?(params[:artist_id])

INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Song 2"], ["artist_id", 1], ["created_at", "2016-01-27 00:20:14.516774"], ["updated_at", "2016-01-27 00:20:14.516774"]]
---
  def create
    # raise.params.inspect
    @song = Song.new(song_params)

    if @song.save

SELECT "artists".* FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1]]
---
  def edit
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
      redirect_to artists_path, alert: "Artist not found."
    elsif params[:artist_id] && Artist.exists?(params[:artist_id])
      artist = Artist.find(params[:artist_id])
      @song = artist.songs.find_by(id: params[:id])